program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<string, []> var_44_pad_type_0 = const()[name = tensor<string, []>("op_44_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_44_pad_0 = const()[name = tensor<string, []>("op_44_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_44_strides_0 = const()[name = tensor<string, []>("op_44_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_44_dilations_0 = const()[name = tensor<string, []>("op_44_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_44_groups_0 = const()[name = tensor<string, []>("op_44_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [768, 80, 3]> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, [768, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [768]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368768)))];
            tensor<fp16, [1, 80, 3000]> logmel_data_to_fp16 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data)[name = tensor<string, []>("cast_51")];
            tensor<fp16, [1, 768, 3000]> var_44_cast_fp16 = conv(bias = const_1_to_fp16, dilations = var_44_dilations_0, groups = var_44_groups_0, pad = var_44_pad_0, pad_type = var_44_pad_type_0, strides = var_44_strides_0, weight = const_0_to_fp16, x = logmel_data_to_fp16)[name = tensor<string, []>("op_44_cast_fp16")];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 3000]> input_1_cast_fp16 = gelu(mode = input_1_mode_0, x = var_44_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_62_pad_type_0 = const()[name = tensor<string, []>("op_62_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_62_pad_0 = const()[name = tensor<string, []>("op_62_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [1]> var_62_strides_0 = const()[name = tensor<string, []>("op_62_strides_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_62_dilations_0 = const()[name = tensor<string, []>("op_62_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> var_62_groups_0 = const()[name = tensor<string, []>("op_62_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 3]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [768, 768, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(370368)))];
            tensor<fp16, [768]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3909376)))];
            tensor<fp16, [1, 768, 1500]> var_62_cast_fp16 = conv(bias = const_3_to_fp16, dilations = var_62_dilations_0, groups = var_62_groups_0, pad = var_62_pad_0, pad_type = var_62_pad_type_0, strides = var_62_strides_0, weight = const_2_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_62_cast_fp16")];
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 1500]> x_3_cast_fp16 = gelu(mode = x_3_mode_0, x = var_62_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [768, 1500]> var_67_to_fp16 = const()[name = tensor<string, []>("op_67_to_fp16"), val = tensor<fp16, [768, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3910976)))];
            tensor<fp16, [1, 768, 1500]> var_69_cast_fp16 = add(x = x_3_cast_fp16, y = var_67_to_fp16)[name = tensor<string, []>("op_69_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 768, 1, 1500]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_69_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_3_axes_0 = const()[name = tensor<string, []>("input_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [768]> input_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_3_gamma_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6215040)))];
            tensor<fp16, [768]> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6216640)))];
            tensor<fp16, []> var_100_to_fp16 = const()[name = tensor<string, []>("op_100_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 768, 1, 1500]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_0, beta = input_3_beta_0_to_fp16, epsilon = var_100_to_fp16, gamma = input_3_gamma_0_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_1_strides_0 = const()[name = tensor<string, []>("q_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_1_dilations_0 = const()[name = tensor<string, []>("q_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_1_groups_0 = const()[name = tensor<string, []>("q_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> var_135_weight_0_to_fp16 = const()[name = tensor<string, []>("op_135_weight_0_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6218240)))];
            tensor<fp16, [768]> var_135_bias_0_to_fp16 = const()[name = tensor<string, []>("op_135_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7397952)))];
            tensor<fp16, [1, 768, 1, 1500]> var_135_cast_fp16 = conv(bias = var_135_bias_0_to_fp16, dilations = q_1_dilations_0, groups = q_1_groups_0, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = q_1_strides_0, weight = var_135_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_135_cast_fp16")];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_1_strides_0 = const()[name = tensor<string, []>("k_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_1_dilations_0 = const()[name = tensor<string, []>("k_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_1_groups_0 = const()[name = tensor<string, []>("k_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7399552)))];
            tensor<fp16, [1, 768, 1, 1500]> k_1_cast_fp16 = conv(dilations = k_1_dilations_0, groups = k_1_groups_0, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = k_1_strides_0, weight = blocks_0_attn_key_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<string, []> var_133_pad_type_0 = const()[name = tensor<string, []>("op_133_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_133_strides_0 = const()[name = tensor<string, []>("op_133_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_133_pad_0 = const()[name = tensor<string, []>("op_133_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_133_dilations_0 = const()[name = tensor<string, []>("op_133_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_133_groups_0 = const()[name = tensor<string, []>("op_133_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8579264)))];
            tensor<fp16, [768]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9758976)))];
            tensor<fp16, [1, 768, 1, 1500]> var_133_cast_fp16 = conv(bias = blocks_0_attn_value_bias_to_fp16, dilations = var_133_dilations_0, groups = var_133_groups_0, pad = var_133_pad_0, pad_type = var_133_pad_type_0, strides = var_133_strides_0, weight = blocks_0_attn_value_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_133_cast_fp16")];
            tensor<int32, [12]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [12]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_136_axis_0 = const()[name = tensor<string, []>("op_136_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_136_cast_fp16_11 = split(axis = var_136_axis_0, split_sizes = tile_0, x = var_135_cast_fp16)[name = tensor<string, []>("op_136_cast_fp16")];
            tensor<int32, [4]> var_149_perm_0 = const()[name = tensor<string, []>("op_149_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [12]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [12]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_150_axis_0 = const()[name = tensor<string, []>("op_150_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 768]> var_149_cast_fp16 = transpose(perm = var_149_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_12")];
            tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_7, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_8, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_9, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_10, tensor<fp16, [1, 1500, 1, 64]> var_150_cast_fp16_11 = split(axis = var_150_axis_0, split_sizes = tile_1, x = var_149_cast_fp16)[name = tensor<string, []>("op_150_cast_fp16")];
            tensor<int32, [12]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [12]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_163_axis_0 = const()[name = tensor<string, []>("op_163_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_163_cast_fp16_11 = split(axis = var_163_axis_0, split_sizes = tile_2, x = var_133_cast_fp16)[name = tensor<string, []>("op_163_cast_fp16")];
            tensor<string, []> aw_1_equation_0 = const()[name = tensor<string, []>("aw_1_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_1_cast_fp16 = einsum(equation = aw_1_equation_0, values = (var_150_cast_fp16_0, var_136_cast_fp16_0))[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<string, []> aw_3_equation_0 = const()[name = tensor<string, []>("aw_3_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_3_cast_fp16 = einsum(equation = aw_3_equation_0, values = (var_150_cast_fp16_1, var_136_cast_fp16_1))[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<string, []> aw_5_equation_0 = const()[name = tensor<string, []>("aw_5_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_5_cast_fp16 = einsum(equation = aw_5_equation_0, values = (var_150_cast_fp16_2, var_136_cast_fp16_2))[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<string, []> aw_7_equation_0 = const()[name = tensor<string, []>("aw_7_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_7_cast_fp16 = einsum(equation = aw_7_equation_0, values = (var_150_cast_fp16_3, var_136_cast_fp16_3))[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<string, []> aw_9_equation_0 = const()[name = tensor<string, []>("aw_9_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_9_cast_fp16 = einsum(equation = aw_9_equation_0, values = (var_150_cast_fp16_4, var_136_cast_fp16_4))[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<string, []> aw_11_equation_0 = const()[name = tensor<string, []>("aw_11_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_11_cast_fp16 = einsum(equation = aw_11_equation_0, values = (var_150_cast_fp16_5, var_136_cast_fp16_5))[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<string, []> aw_13_equation_0 = const()[name = tensor<string, []>("aw_13_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_13_cast_fp16 = einsum(equation = aw_13_equation_0, values = (var_150_cast_fp16_6, var_136_cast_fp16_6))[name = tensor<string, []>("aw_13_cast_fp16")];
            tensor<string, []> aw_15_equation_0 = const()[name = tensor<string, []>("aw_15_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_15_cast_fp16 = einsum(equation = aw_15_equation_0, values = (var_150_cast_fp16_7, var_136_cast_fp16_7))[name = tensor<string, []>("aw_15_cast_fp16")];
            tensor<string, []> aw_17_equation_0 = const()[name = tensor<string, []>("aw_17_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_17_cast_fp16 = einsum(equation = aw_17_equation_0, values = (var_150_cast_fp16_8, var_136_cast_fp16_8))[name = tensor<string, []>("aw_17_cast_fp16")];
            tensor<string, []> aw_19_equation_0 = const()[name = tensor<string, []>("aw_19_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_19_cast_fp16 = einsum(equation = aw_19_equation_0, values = (var_150_cast_fp16_9, var_136_cast_fp16_9))[name = tensor<string, []>("aw_19_cast_fp16")];
            tensor<string, []> aw_21_equation_0 = const()[name = tensor<string, []>("aw_21_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_21_cast_fp16 = einsum(equation = aw_21_equation_0, values = (var_150_cast_fp16_10, var_136_cast_fp16_10))[name = tensor<string, []>("aw_21_cast_fp16")];
            tensor<string, []> aw_23_equation_0 = const()[name = tensor<string, []>("aw_23_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_23_cast_fp16 = einsum(equation = aw_23_equation_0, values = (var_150_cast_fp16_11, var_136_cast_fp16_11))[name = tensor<string, []>("aw_23_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_200_cast_fp16 = softmax(axis = var_84, x = aw_1_cast_fp16)[name = tensor<string, []>("op_200_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_201_cast_fp16 = softmax(axis = var_84, x = aw_3_cast_fp16)[name = tensor<string, []>("op_201_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_202_cast_fp16 = softmax(axis = var_84, x = aw_5_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_203_cast_fp16 = softmax(axis = var_84, x = aw_7_cast_fp16)[name = tensor<string, []>("op_203_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_204_cast_fp16 = softmax(axis = var_84, x = aw_9_cast_fp16)[name = tensor<string, []>("op_204_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_205_cast_fp16 = softmax(axis = var_84, x = aw_11_cast_fp16)[name = tensor<string, []>("op_205_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_206_cast_fp16 = softmax(axis = var_84, x = aw_13_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_207_cast_fp16 = softmax(axis = var_84, x = aw_15_cast_fp16)[name = tensor<string, []>("op_207_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_208_cast_fp16 = softmax(axis = var_84, x = aw_17_cast_fp16)[name = tensor<string, []>("op_208_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_209_cast_fp16 = softmax(axis = var_84, x = aw_19_cast_fp16)[name = tensor<string, []>("op_209_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_210_cast_fp16 = softmax(axis = var_84, x = aw_21_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_211_cast_fp16 = softmax(axis = var_84, x = aw_23_cast_fp16)[name = tensor<string, []>("op_211_cast_fp16")];
            tensor<string, []> var_213_equation_0 = const()[name = tensor<string, []>("op_213_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_213_cast_fp16 = einsum(equation = var_213_equation_0, values = (var_163_cast_fp16_0, var_200_cast_fp16))[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<string, []> var_215_equation_0 = const()[name = tensor<string, []>("op_215_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_215_cast_fp16 = einsum(equation = var_215_equation_0, values = (var_163_cast_fp16_1, var_201_cast_fp16))[name = tensor<string, []>("op_215_cast_fp16")];
            tensor<string, []> var_217_equation_0 = const()[name = tensor<string, []>("op_217_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_217_cast_fp16 = einsum(equation = var_217_equation_0, values = (var_163_cast_fp16_2, var_202_cast_fp16))[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<string, []> var_219_equation_0 = const()[name = tensor<string, []>("op_219_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_219_cast_fp16 = einsum(equation = var_219_equation_0, values = (var_163_cast_fp16_3, var_203_cast_fp16))[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<string, []> var_221_equation_0 = const()[name = tensor<string, []>("op_221_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_221_cast_fp16 = einsum(equation = var_221_equation_0, values = (var_163_cast_fp16_4, var_204_cast_fp16))[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<string, []> var_223_equation_0 = const()[name = tensor<string, []>("op_223_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_223_cast_fp16 = einsum(equation = var_223_equation_0, values = (var_163_cast_fp16_5, var_205_cast_fp16))[name = tensor<string, []>("op_223_cast_fp16")];
            tensor<string, []> var_225_equation_0 = const()[name = tensor<string, []>("op_225_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_225_cast_fp16 = einsum(equation = var_225_equation_0, values = (var_163_cast_fp16_6, var_206_cast_fp16))[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<string, []> var_227_equation_0 = const()[name = tensor<string, []>("op_227_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_227_cast_fp16 = einsum(equation = var_227_equation_0, values = (var_163_cast_fp16_7, var_207_cast_fp16))[name = tensor<string, []>("op_227_cast_fp16")];
            tensor<string, []> var_229_equation_0 = const()[name = tensor<string, []>("op_229_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_229_cast_fp16 = einsum(equation = var_229_equation_0, values = (var_163_cast_fp16_8, var_208_cast_fp16))[name = tensor<string, []>("op_229_cast_fp16")];
            tensor<string, []> var_231_equation_0 = const()[name = tensor<string, []>("op_231_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_231_cast_fp16 = einsum(equation = var_231_equation_0, values = (var_163_cast_fp16_9, var_209_cast_fp16))[name = tensor<string, []>("op_231_cast_fp16")];
            tensor<string, []> var_233_equation_0 = const()[name = tensor<string, []>("op_233_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_233_cast_fp16 = einsum(equation = var_233_equation_0, values = (var_163_cast_fp16_10, var_210_cast_fp16))[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<string, []> var_235_equation_0 = const()[name = tensor<string, []>("op_235_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_235_cast_fp16 = einsum(equation = var_235_equation_0, values = (var_163_cast_fp16_11, var_211_cast_fp16))[name = tensor<string, []>("op_235_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 768, 1, 1500]> input_5_cast_fp16 = concat(axis = var_84, interleave = input_5_interleave_0, values = (var_213_cast_fp16, var_215_cast_fp16, var_217_cast_fp16, var_219_cast_fp16, var_221_cast_fp16, var_223_cast_fp16, var_225_cast_fp16, var_227_cast_fp16, var_229_cast_fp16, var_231_cast_fp16, var_233_cast_fp16, var_235_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> var_244_pad_type_0 = const()[name = tensor<string, []>("op_244_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_244_strides_0 = const()[name = tensor<string, []>("op_244_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_244_pad_0 = const()[name = tensor<string, []>("op_244_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_244_dilations_0 = const()[name = tensor<string, []>("op_244_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_244_groups_0 = const()[name = tensor<string, []>("op_244_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9760576)))];
            tensor<fp16, [768]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10940288)))];
            tensor<fp16, [1, 768, 1, 1500]> var_244_cast_fp16 = conv(bias = blocks_0_attn_out_bias_to_fp16, dilations = var_244_dilations_0, groups = var_244_groups_0, pad = var_244_pad_0, pad_type = var_244_pad_type_0, strides = var_244_strides_0, weight = blocks_0_attn_out_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("op_244_cast_fp16")];
            tensor<fp16, [1, 768, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = var_244_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [768]> input_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_7_gamma_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10941888)))];
            tensor<fp16, [768]> input_7_beta_0_to_fp16 = const()[name = tensor<string, []>("input_7_beta_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10943488)))];
            tensor<fp16, []> var_254_to_fp16 = const()[name = tensor<string, []>("op_254_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 768, 1, 1500]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = input_7_beta_0_to_fp16, epsilon = var_254_to_fp16, gamma = input_7_gamma_0_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [3072, 768, 1, 1]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [3072, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10945088)))];
            tensor<fp16, [3072]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15663744)))];
            tensor<fp16, [1, 3072, 1, 1500]> input_9_cast_fp16 = conv(bias = blocks_0_mlp_0_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = blocks_0_mlp_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 3072, 1, 1500]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> var_280_pad_type_0 = const()[name = tensor<string, []>("op_280_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_280_strides_0 = const()[name = tensor<string, []>("op_280_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_280_pad_0 = const()[name = tensor<string, []>("op_280_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_280_dilations_0 = const()[name = tensor<string, []>("op_280_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_280_groups_0 = const()[name = tensor<string, []>("op_280_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 3072, 1, 1]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [768, 3072, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15669952)))];
            tensor<fp16, [768]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20388608)))];
            tensor<fp16, [1, 768, 1, 1500]> var_280_cast_fp16 = conv(bias = blocks_0_mlp_2_bias_to_fp16, dilations = var_280_dilations_0, groups = var_280_groups_0, pad = var_280_pad_0, pad_type = var_280_pad_type_0, strides = var_280_strides_0, weight = blocks_0_mlp_2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("op_280_cast_fp16")];
            tensor<fp16, [1, 768, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = var_280_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_289 = const()[name = tensor<string, []>("op_289"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [768]> input_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_13_gamma_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20390208)))];
            tensor<fp16, [768]> input_13_beta_0_to_fp16 = const()[name = tensor<string, []>("input_13_beta_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20391808)))];
            tensor<fp16, []> var_305_to_fp16 = const()[name = tensor<string, []>("op_305_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 768, 1, 1500]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = input_13_beta_0_to_fp16, epsilon = var_305_to_fp16, gamma = input_13_gamma_0_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> q_3_strides_0 = const()[name = tensor<string, []>("q_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> q_3_dilations_0 = const()[name = tensor<string, []>("q_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> q_3_groups_0 = const()[name = tensor<string, []>("q_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> var_340_weight_0_to_fp16 = const()[name = tensor<string, []>("op_340_weight_0_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20393408)))];
            tensor<fp16, [768]> var_340_bias_0_to_fp16 = const()[name = tensor<string, []>("op_340_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21573120)))];
            tensor<fp16, [1, 768, 1, 1500]> var_340_cast_fp16 = conv(bias = var_340_bias_0_to_fp16, dilations = q_3_dilations_0, groups = q_3_groups_0, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = q_3_strides_0, weight = var_340_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_340_cast_fp16")];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> k_3_strides_0 = const()[name = tensor<string, []>("k_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> k_3_dilations_0 = const()[name = tensor<string, []>("k_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> k_3_groups_0 = const()[name = tensor<string, []>("k_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21574720)))];
            tensor<fp16, [1, 768, 1, 1500]> k_3_cast_fp16 = conv(dilations = k_3_dilations_0, groups = k_3_groups_0, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = k_3_strides_0, weight = blocks_1_attn_key_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<string, []> var_338_pad_type_0 = const()[name = tensor<string, []>("op_338_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_338_strides_0 = const()[name = tensor<string, []>("op_338_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_338_pad_0 = const()[name = tensor<string, []>("op_338_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_338_dilations_0 = const()[name = tensor<string, []>("op_338_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_338_groups_0 = const()[name = tensor<string, []>("op_338_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [768, 768, 1, 1]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22754432)))];
            tensor<fp16, [768]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23934144)))];
            tensor<fp16, [1, 768, 1, 1500]> var_338_cast_fp16 = conv(bias = blocks_1_attn_value_bias_to_fp16, dilations = var_338_dilations_0, groups = var_338_groups_0, pad = var_338_pad_0, pad_type = var_338_pad_type_0, strides = var_338_strides_0, weight = blocks_1_attn_value_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_338_cast_fp16")];
            tensor<int32, [12]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [12]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_341_axis_0 = const()[name = tensor<string, []>("op_341_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_341_cast_fp16_11 = split(axis = var_341_axis_0, split_sizes = tile_3, x = var_340_cast_fp16)[name = tensor<string, []>("op_341_cast_fp16")];
            tensor<int32, [4]> var_354_perm_0 = const()[name = tensor<string, []>("op_354_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [12]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [12]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_355_axis_0 = const()[name = tensor<string, []>("op_355_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 768]> var_354_cast_fp16 = transpose(perm = var_354_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_11")];
            tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_7, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_8, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_9, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_10, tensor<fp16, [1, 1500, 1, 64]> var_355_cast_fp16_11 = split(axis = var_355_axis_0, split_sizes = tile_4, x = var_354_cast_fp16)[name = tensor<string, []>("op_355_cast_fp16")];
            tensor<int32, [12]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [12]>([64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_368_axis_0 = const()[name = tensor<string, []>("op_368_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_7, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_8, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_9, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_10, tensor<fp16, [1, 64, 1, 1500]> var_368_cast_fp16_11 = split(axis = var_368_axis_0, split_sizes = tile_5, x = var_338_cast_fp16)[name = tensor<string, []>("op_368_cast_fp16")];
            tensor<string, []> aw_25_equation_0 = const()[name = tensor<string, []>("aw_25_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_25_cast_fp16 = einsum(equation = aw_25_equation_0, values = (var_355_cast_fp16_0, var_341_cast_fp16_0))[name = tensor<string, []>("aw_25_cast_fp16")];
            tensor<string, []> aw_27_equation_0 = const()[name = tensor<string, []>("aw_27_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_27_cast_fp16 = einsum(equation = aw_27_equation_0, values = (var_355_cast_fp16_1, var_341_cast_fp16_1))[name = tensor<string, []>("aw_27_cast_fp16")];
            tensor<string, []> aw_29_equation_0 = const()[name = tensor<string, []>("aw_29_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_29_cast_fp16 = einsum(equation = aw_29_equation_0, values = (var_355_cast_fp16_2, var_341_cast_fp16_2))[name = tensor<string, []>("aw_29_cast_fp16")];
            tensor<string, []> aw_31_equation_0 = const()[name = tensor<string, []>("aw_31_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_31_cast_fp16 = einsum(equation = aw_31_equation_0, values = (var_355_cast_fp16_3, var_341_cast_fp16_3))[name = tensor<string, []>("aw_31_cast_fp16")];
            tensor<string, []> aw_33_equation_0 = const()[name = tensor<string, []>("aw_33_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_33_cast_fp16 = einsum(equation = aw_33_equation_0, values = (var_355_cast_fp16_4, var_341_cast_fp16_4))[name = tensor<string, []>("aw_33_cast_fp16")];
            tensor<string, []> aw_35_equation_0 = const()[name = tensor<string, []>("aw_35_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_35_cast_fp16 = einsum(equation = aw_35_equation_0, values = (var_355_cast_fp16_5, var_341_cast_fp16_5))[name = tensor<string, []>("aw_35_cast_fp16")];
            tensor<string, []> aw_37_equation_0 = const()[name = tensor<string, []>("aw_37_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_37_cast_fp16 = einsum(equation = aw_37_equation_0, values = (var_355_cast_fp16_6, var_341_cast_fp16_6))[name = tensor<string, []>("aw_37_cast_fp16")];
            tensor<string, []> aw_39_equation_0 = const()[name = tensor<string, []>("aw_39_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_39_cast_fp16 = einsum(equation = aw_39_equation_0, values = (var_355_cast_fp16_7, var_341_cast_fp16_7))[name = tensor<string, []>("aw_39_cast_fp16")];
            tensor<string, []> aw_41_equation_0 = const()[name = tensor<string, []>("aw_41_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_41_cast_fp16 = einsum(equation = aw_41_equation_0, values = (var_355_cast_fp16_8, var_341_cast_fp16_8))[name = tensor<string, []>("aw_41_cast_fp16")];
            tensor<string, []> aw_43_equation_0 = const()[name = tensor<string, []>("aw_43_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_43_cast_fp16 = einsum(equation = aw_43_equation_0, values = (var_355_cast_fp16_9, var_341_cast_fp16_9))[name = tensor<string, []>("aw_43_cast_fp16")];
            tensor<string, []> aw_45_equation_0 = const()[name = tensor<string, []>("aw_45_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_45_cast_fp16 = einsum(equation = aw_45_equation_0, values = (var_355_cast_fp16_10, var_341_cast_fp16_10))[name = tensor<string, []>("aw_45_cast_fp16")];
            tensor<string, []> aw_47_equation_0 = const()[name = tensor<string, []>("aw_47_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_47_cast_fp16 = einsum(equation = aw_47_equation_0, values = (var_355_cast_fp16_11, var_341_cast_fp16_11))[name = tensor<string, []>("aw_47_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_405_cast_fp16 = softmax(axis = var_289, x = aw_25_cast_fp16)[name = tensor<string, []>("op_405_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_406_cast_fp16 = softmax(axis = var_289, x = aw_27_cast_fp16)[name = tensor<string, []>("op_406_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_407_cast_fp16 = softmax(axis = var_289, x = aw_29_cast_fp16)[name = tensor<string, []>("op_407_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_408_cast_fp16 = softmax(axis = var_289, x = aw_31_cast_fp16)[name = tensor<string, []>("op_408_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_409_cast_fp16 = softmax(axis = var_289, x = aw_33_cast_fp16)[name = tensor<string, []>("op_409_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_410_cast_fp16 = softmax(axis = var_289, x = aw_35_cast_fp16)[name = tensor<string, []>("op_410_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_411_cast_fp16 = softmax(axis = var_289, x = aw_37_cast_fp16)[name = tensor<string, []>("op_411_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_412_cast_fp16 = softmax(axis = var_289, x = aw_39_cast_fp16)[name = tensor<string, []>("op_412_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_413_cast_fp16 = softmax(axis = var_289, x = aw_41_cast_fp16)[name = tensor<string, []>("op_413_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_414_cast_fp16 = softmax(axis = var_289, x = aw_43_cast_fp16)[name = tensor<string, []>("op_414_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_415_cast_fp16 = softmax(axis = var_289, x = aw_45_cast_fp16)[name = tensor<string, []>("op_415_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_416_cast_fp16 = softmax(axis = var_289, x = aw_47_cast_fp16)[name = tensor<string, []>("op_416_cast_fp16")];
            tensor<string, []> var_418_equation_0 = const()[name = tensor<string, []>("op_418_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_418_cast_fp16 = einsum(equation = var_418_equation_0, values = (var_368_cast_fp16_0, var_405_cast_fp16))[name = tensor<string, []>("op_418_cast_fp16")];
            tensor<string, []> var_420_equation_0 = const()[name = tensor<string, []>("op_420_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_420_cast_fp16 = einsum(equation = var_420_equation_0, values = (var_368_cast_fp16_1, var_406_cast_fp16))[name = tensor<string, []>("op_420_cast_fp16")];
            tensor<string, []> var_422_equation_0 = const()[name = tensor<string, []>("op_422_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_422_cast_fp16 = einsum(equation = var_422_equation_0, values = (var_368_cast_fp16_2, var_407_cast_fp16))[name = tensor<string, []>("op_422_cast_fp16")];
            tensor<string, []> var_424_equation_0 = const()[name = tensor<string, []>("op_424_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_424_cast_fp16 = einsum(equation = var_424_equation_0, values = (var_368_cast_fp16_3, var_408_cast_fp16))[name = tensor<string, []>("op_424_cast_fp16")];
            tensor<string, []> var_426_equation_0 = const()[name = tensor<string, []>("op_426_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_426_cast_fp16 = einsum(equation = var_426_equation_0, values = (var_368_cast_fp16_4, var_409_cast_fp16))[name = tensor<string, []>("op_426_cast_fp16")];
            tensor<string, []> var_428_equation_0 = const()[name = tensor<string, []>("op_428_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_428_cast_fp16 = einsum(equation = var_428_equation_0, values = (var_368_cast_fp16_5, var_410_cast_fp16))[name = tensor<string, []>("op_428_cast_fp16")];
            tensor<string, []> var_430_equation_0 = const()[name = tensor<string, []>("op_430_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_430_cast_fp16 = einsum(equation = var_430_equation_0, values = (var_368_cast_fp16_6, var_411_cast_fp16))[name = tensor<string, []>("op_430_cast_fp16")];
            tensor<string, []> var_432_equation_0 = const()[name = tensor<string, []>("op_432_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_432_cast_fp16 = einsum(equation = var_432_equation_0, values = (var_368_cast_fp16_7, var_412_cast_fp16))[name = tensor<string, []>("op_432_cast_fp16")];
            tensor<string, []> var_434_equation_0 = const()[name = tensor<string, []>("op_434_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_434_cast_fp16 = einsum(equation = var_434_equation_0, values = (var_368_cast_fp16_8, var_413_cast_fp16))[name = tensor<string, []>("op_434_cast_fp16")];
            tensor<string, []> var_436_equation_0 = const()[name = tensor<string, []>("op_436_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
